app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2018-10-17 16:31:57.992596"], ["updated_at", "2018-10-17 16:31:57.992596"]]
DELETE FROM "artists"
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-10-17 16:32:51.481104"], ["updated_at", "2018-10-17 16:32:51.481104"]]
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      Song.create(title: song[0])
      Artist.delete_all
      Artist.create(name: song[1])